#!/usr/bin/env bash

#
# ファイルの先頭行を除く
#
# REFERENCES::
#  - https://linuxhint.com/skip_line_awk/

fname=./sfl_awk

echo -e 'hello\nworld' > "$fname"

echo '[original] ----------------------------------------------'
cat "$fname"
echo '---------------------------------------------------------'

echo '[NR>1] --------------------------------------------------'
# NR は awk で使われる組み込み変数で，入力行の行番号がセットされている.
# なので、行番号が1より大きいものという条件となる
awk 'NR>1' "$fname"
echo '---------------------------------------------------------'

echo '[NR!=1] -------------------------------------------------'
# 先の例と同じで、条件の書き方の違い
awk 'NR!=1' "$fname"
echo '---------------------------------------------------------'

echo '[if print] ----------------------------------------------'
# awk では if も利用できる
awk '{if (NR!=1) { print }}' "$fname"
echo '---------------------------------------------------------'

echo '[ls -l] -------------------------------------------------'
ls -l
echo '---------------------------------------------------------'

echo '[ls -l | awk combination] -------------------------------'
ls -l | awk '{print $9}' | awk 'NR!=1' 
echo '---------------------------------------------------------'

rm -f "$fname"